In [1]:
import pandas as pd

In [11]:
df=pd.read_csv('loan_prediction.csv')

In [12]:
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [13]:
df.shape

(614, 13)

In [14]:
ds=df.dropna(axis=0)

In [15]:
ds.shape

(480, 13)

In [26]:
print('percentage of data loss',((df.shape[0]-ds.shape[0])/df.shape[0])*100,)

percentage of data loss 21.824104234527688

In [30]:
print('percentage of data loss',round(((df.shape[0]-ds.shape[0])/df.shape[0])*100,2))

percentage of data loss 21.82

In [31]:
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

How to deal with null values:
1. IF its a large dataset.if the null values are very less u can remove it.
2.U have to replace it with mean or median or mode

In [32]:
df.head(2)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N

In [29]:
df['Gender'].value_counts()

Gender
Male      489
Female    112
Name: count, dtype: int64

In [33]:
df['Gender'].mode()

0    Male
Name: Gender, dtype: object

In [34]:
df['Gender']=df['Gender'].fillna(df['Gender'].mode()[0])

In [35]:
df.isnull().sum()

Loan_ID               0
Gender                0
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [36]:
df.isnull().sum()

Loan_ID               0
Gender                0
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [37]:
df['Dependents'].value_counts()

Dependents
0     345
1     102
2     101
3+     51
Name: count, dtype: int64

In [38]:
df['Dependents'].mode()

0    0
Name: Dependents, dtype: object

In [39]:
df['Dependents']=df['Dependents'].fillna(df['Dependents'].mode()[0])

In [40]:
df['LoanAmount'].mean()

146.41216216216216

In [41]:
df['LoanAmount'].mode()

0    120.0
Name: LoanAmount, dtype: float64

In [42]:
df['LoanAmount']=df['LoanAmount'].fillna(df['LoanAmount'].mean())

In [44]:
df['Loan_Amount_Term'].value_counts()

Loan_Amount_Term
360.0    512
180.0     44
480.0     15
300.0     13
240.0      4
84.0       4
120.0      3
60.0       2
36.0       2
12.0       1
Name: count, dtype: int64

In [45]:
df['Loan_Amount_Term'].mode()

0    360.0
Name: Loan_Amount_Term, dtype: float64

Data Time Functions

In [48]:
df=pd.read_csv('hrdata.csv')

In [49]:
df

     Name    HireDate  Salary  SickDaysremaining
0     Raj   8/11/2015   50000                 12
1   Kumar   6/22/2014   52000                  8
2  Kannan   5/12/2013   60000                  7
3  Suresh    1/7/2015   44000                  5
4   Ashok  12/11/2013   62000                 11
5   Kamal    1/2/2015   55000                 18

In [50]:
df.dtypes

Name                 object
HireDate             object
Salary                int64
SickDaysremaining     int64
dtype: object

In [51]:
df['HireDate']

0     8/11/2015
1     6/22/2014
2     5/12/2013
3      1/7/2015
4    12/11/2013
5      1/2/2015
Name: HireDate, dtype: object